/*
*********************************************************************************************************
*
*	模块名称 : 信息打印
*	文件名称 : Disp.c
*	版    本 : V1.0
*	说    明 : 打印相关信息
*
*	修改记录 :
*		版本号  日期        作者     说明
*		V1.0    2019-10-28 Will     
*
*********************************************************************************************************
*/

#include "bsp.h"

/*
*********************************************************************************************************
*	函 数 名: PrintfLogo
*	功能说明: 打印例程名称和例程发布日期, 接上串口线后，打开PC机的超级终端软件可以观察结果
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void PrintfLogo(void)
{
	printf("*************************************************************\n\r");
	
	/* 检测CPU ID */
	{
		uint32_t CPU_Sn0, CPU_Sn1, CPU_Sn2;
		
		CPU_Sn0 = *(__IO uint32_t*)(0x1FFF7A10);
		CPU_Sn1 = *(__IO uint32_t*)(0x1FFF7A10 + 4);
		CPU_Sn2 = *(__IO uint32_t*)(0x1FFF7A10 + 8);

		printf("\r\nCPU : STM32F429BIT6, LQFP208, 主频: %dMHz\r\n", SystemCoreClock / 1000000);
		printf("UID = %08X %08X %08X\n\r", CPU_Sn2, CPU_Sn1, CPU_Sn0);
	}

	printf("\n\r");
	printf("*************************************************************\n\r");

	/* 打印ST的HAL库版本 */
	printf("* HAL库版本  : V2.4.0 (STM32F429 HAL Driver)\r\n");
	printf("*************************************************************\n\r");
}


/*
*********************************************************************************************************
*	函 数 名: PrintfHelp
*	功能说明: 打印操作提示
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void PrintfHelp(void)
{
	printf("操作提示:\r\n");
	printf("1. 启动一个自动重装软件定时器，每100ms翻转一次LED2\r\n");
	printf("2. 串口接收到字符命令'1'，返回串口消息接收到串口命令1\r\n");
	printf("3. 串口接收到字符命令'2'，返回串口消息接收到串口命令2\r\n");
	printf("4. 串口接收到字符命令'3'，返回串口消息接收到串口命令3\r\n");
	printf("5. 串口接收到字符命令'4'，返回串口消息接收到串口命令4\r\n");
	printf("6. K1按键按下，串口打印按键K1按下\r\n");
	printf("7. K2按键按下，串口打印按键K2按下\r\n");
	printf("8. K3按键按下，串口打印按键K3按下\r\n");
}

/***************************** (END OF FILE) *********************************/
